{
  "_name_or_path": "openmmlab/upernet-swin-small",
  "architectures": [
    "UperNetForSemanticSegmentation"
  ],
  "auxiliary_channels": 256,
  "auxiliary_concat_input": false,
  "auxiliary_in_channels": 384,
  "auxiliary_loss_weight": 0.4,
  "auxiliary_num_convs": 1,
  "backbone": null,
  "backbone_config": {
    "attention_probs_dropout_prob": 0.0,
    "depths": [
      2,
      2,
      18,
      2
    ],
    "drop_path_rate": 0.1,
    "embed_dim": 96,
    "encoder_stride": 32,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.0,
    "hidden_size": 768,
    "image_size": 224,
    "initializer_range": 0.02,
    "layer_norm_eps": 1e-05,
    "mlp_ratio": 4.0,
    "model_type": "swin",
    "num_heads": [
      3,
      6,
      12,
      24
    ],
    "num_layers": 4,
    "out_features": [
      "stage1",
      "stage2",
      "stage3",
      "stage4"
    ],
    "out_indices": [
      1,
      2,
      3,
      4
    ],
    "patch_size": 4,
    "path_norm": true,
    "qkv_bias": true,
    "use_absolute_embeddings": false,
    "window_size": 7
  },
  "backbone_kwargs": null,
  "hidden_size": 512,
  "id2label": {
    "0": "Trapezium",
    "1": "Trapezoid",
    "2": "Capitate",
    "3": "Hamate",
    "4": "Scaphoid",
    "5": "Lunate",
    "6": "Triquetrum",
    "7": "Pisiform"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Capitate": 2,
    "Hamate": 3,
    "Lunate": 5,
    "Pisiform": 7,
    "Scaphoid": 4,
    "Trapezium": 0,
    "Trapezoid": 1,
    "Triquetrum": 6
  },
  "loss_ignore_index": 255,
  "model_type": "upernet",
  "pool_scales": [
    1,
    2,
    3,
    6
  ],
  "torch_dtype": "float32",
  "transformers_version": "4.46.3",
  "use_auxiliary_head": true,
  "use_pretrained_backbone": false,
  "use_timm_backbone": false
}
