{
  "_name_or_path": "/data/ephemeral/home/Dongjin/level2-cv-semanticsegmentation-cv-02-lv3/Baseline/Dongjin/transformers_1119/trained_models/cont/upernet-convnext-small_cont_size_1024/ep_19_vdice_0.9701",
  "architectures": [
    "UperNetForSemanticSegmentation"
  ],
  "auxiliary_channels": 256,
  "auxiliary_concat_input": false,
  "auxiliary_in_channels": 384,
  "auxiliary_loss_weight": 0.4,
  "auxiliary_num_convs": 1,
  "backbone": null,
  "backbone_config": {
    "depths": [
      3,
      3,
      27,
      3
    ],
    "drop_path_rate": 0.0,
    "hidden_act": "gelu",
    "hidden_sizes": [
      96,
      192,
      384,
      768
    ],
    "image_size": 224,
    "initializer_range": 0.02,
    "layer_norm_eps": 1e-12,
    "layer_scale_init_value": 1e-06,
    "model_type": "convnext",
    "num_stages": 4,
    "out_features": [
      "stage1",
      "stage2",
      "stage3",
      "stage4"
    ],
    "out_indices": [
      1,
      2,
      3,
      4
    ],
    "patch_size": 4
  },
  "backbone_kwargs": null,
  "hidden_size": 512,
  "id2label": {
    "0": "finger-1",
    "1": "finger-2",
    "2": "finger-3",
    "3": "finger-4",
    "4": "finger-5",
    "5": "finger-6",
    "6": "finger-7",
    "7": "finger-8",
    "8": "finger-9",
    "9": "finger-10",
    "10": "finger-11",
    "11": "finger-12",
    "12": "finger-13",
    "13": "finger-14",
    "14": "finger-15",
    "15": "finger-16",
    "16": "finger-17",
    "17": "finger-18",
    "18": "finger-19",
    "19": "Trapezium",
    "20": "Trapezoid",
    "21": "Capitate",
    "22": "Hamate",
    "23": "Scaphoid",
    "24": "Lunate",
    "25": "Triquetrum",
    "26": "Pisiform",
    "27": "Radius",
    "28": "Ulna"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Capitate": 21,
    "Hamate": 22,
    "Lunate": 24,
    "Pisiform": 26,
    "Radius": 27,
    "Scaphoid": 23,
    "Trapezium": 19,
    "Trapezoid": 20,
    "Triquetrum": 25,
    "Ulna": 28,
    "finger-1": 0,
    "finger-10": 9,
    "finger-11": 10,
    "finger-12": 11,
    "finger-13": 12,
    "finger-14": 13,
    "finger-15": 14,
    "finger-16": 15,
    "finger-17": 16,
    "finger-18": 17,
    "finger-19": 18,
    "finger-2": 1,
    "finger-3": 2,
    "finger-4": 3,
    "finger-5": 4,
    "finger-6": 5,
    "finger-7": 6,
    "finger-8": 7,
    "finger-9": 8
  },
  "loss_ignore_index": 255,
  "model_type": "upernet",
  "pool_scales": [
    1,
    2,
    3,
    6
  ],
  "torch_dtype": "float32",
  "transformers_version": "4.46.3",
  "use_auxiliary_head": true,
  "use_pretrained_backbone": false,
  "use_timm_backbone": false
}
